#include <iostream>
#include <vector>
#include <string>
#include <cstring>
#include <cmath>
#include <ctime>
#include <random>
#include <algorithm>

#include "raylib.h"
#include "raymath.h"

using namespace std;

#define x first
#define y second

const int N = 20; // размер клетки

vector<vector<pair<float, float>>> vertices = {
	{{5, 5}, {8, 4}, {12, 4}, {15, 5}, {15, 6}, {12, 8}, {10, 9}, {8, 8}, {5, 6}, {5, 5}}, // голова
	{{6, 6}, {7, 5}, {9, 7}, {11, 7}, {13, 5}, {14, 6}}, // улыбка
	{{8, 4}, {8, 2}, {9, 1}, {10, 2}, {10, 4}, {10, 2}, {11, 1}, {12, 2}, {12, 4}}, // верхние глаза
	{{8.5, 4}, {8.5, 2.5}, {9, 2}, {9.5, 2.5}, {9.5, 4}, {10.5, 4}, {10.5, 2.5}, {11, 2}, {11.5, 2.5}, {11.5, 4}}, // средние глаза
	{{8.75, 4}, {8.75, 3.5}, {9, 3}, {9.25, 3.5}, {9.25, 4}, {10.75, 4}, {10.75, 3.5}, {11, 3}, {11.25, 3.5}, {11.25, 4}}, // нижние глаза 
	{{7, 8}, {7, 12}, {10, 9}, {13, 12}, {13, 8}, {10, 11}, {7, 8}}, // бантик
	{{8, 8}, {8, 9}}, {{12, 8}, {12, 9}}, // шея
	{{7.5, 11.5}, {7, 14}, {4, 14}, {6, 15}, {5, 17}, {7, 16}, {7, 18}, {9, 15},  {9.75, 10.75}}, // левая передняя нога
	{{10.25, 10.75}, {11, 14}, {13, 18}, {13, 16}, {15, 17}, {14, 15}, {16, 14}, {13, 14}, {12.5, 11.5}}, // правая передняя нога
	{{7, 9}, {4, 7}, {2, 8}, {3, 10}, {6, 14}, {7, 14}, {4, 9}}, // левое бедро
	{{5.2, 12.8}, {5, 13}, {3, 13}, {2, 14}, {2, 15}, {3, 14}, {2, 15}, {3, 16}, {4, 15}, {6, 15}}, // левая задняя нога
	{{13, 9}, {16, 7}, {18, 8}, {17, 10}, {14, 14}, {13, 14}, {16, 9}}, // правое бедро
	{{14, 14}, {16, 13}, {17, 13}, {18, 14}, {18, 15}, {17, 14}, {18, 15}, {17, 16}, {16, 15}, {14, 15}}, // правая задняя нога
	{{3, 10}, {2, 13}, {1, 19}, {19, 19}, {18, 13}, {17, 10}}, // шляпка гриба
	{{3, 19}, {4, 19}, {5, 18}, {4, 17}, {3, 17}, {2, 18}, {3, 19}},
	{{4, 13}, {3, 12}, {3.8, 11.2}}, {{16.5, 10.5}, {17, 11}, {16, 12}, {15.5, 12}},
	{{11, 14}, {10, 15}, {11, 16}, {12, 16}}, 
	{{17, 18}, {18, 17}, {17, 16}, {16, 16}, {15, 17}, {16, 18}, {17, 18}},  // пятна на шляпке
	{{8, 19}, {7, 26}}, {{12, 19}, {13, 26}}, // ножка гриба
	{{7, 26}, {6, 23}, {6, 26}, {5, 21}, {5, 25}, {3, 22}, {3, 25}, {1, 24}, {3, 28}, {17, 28},
	 {19, 24}, {17, 25}, {17, 22}, {15, 25}, {15, 21}, {14, 26}, {14, 23}, {13, 26},
	 {12, 24}, {12, 27}, {11, 25}, {10, 28}, {9, 25}, {8, 27}, {8, 24}, {7, 26}} // трава
};

Vector2 scale(pair<float, float> pt) { // увеличение рисунка в соответствии с размером клетки
	return {pt.x * N, pt.y * N};
}

int main() {
	float width = N * 20;
	float height = N * 30;
	SetConfigFlags(FLAG_WINDOW_RESIZABLE);
    InitWindow(width, height, "Potapkina-graphics");
    SetTargetFPS(60);
	while (!WindowShouldClose()) {
		BeginDrawing();
		width = GetScreenWidth();
		height = GetScreenHeight();
        ClearBackground(SKYBLUE);
		for (auto v : vertices) {
			for (int i = 1; i < v.size(); i++) {
				DrawLineEx(scale(v[i - 1]), scale(v[i]), 3, BLACK);
			}
		}
		EndDrawing();
	}
    CloseWindow(); а
}
